
my_dict = {"Пермь":1723, "Лысьва":1785, "Кунгур":1663}
print("Изначальный словарь: ", my_dict)
print("Существующее значение 'Пермь':", my_dict["Пермь"])
print("Несуществующее значение 'Тобольск':", my_dict.get("Тобольск"))
my_dict["Соликамск"] = 1430
my_dict.update({"Березники": 1932, "Полазна": 1623})
print("Новый словарь: ", my_dict)
temp = my_dict.pop("Полазна")
print(temp)
print("Изменённый словарь: ", my_dict)

print("")

my_set = {1, 1, 2.5, 2.5, "string", "string", True, True}
print("Изначальное множество: ",my_set)
my_set.add((3, 4, 5))
my_set.add("new_string")
my_set.discard("string")
print("Изменённое множество: ",my_set)


# -= Result =-
#-----------------------------------------------------------------
# Изначальный словарь:  {'Пермь': 1723, 'Лысьва': 1785, 'Кунгур': 1663}
# Существующее значение 'Пермь': 1723
# Несуществующее значение 'Тобольск': None
# Новый словарь:  {'Пермь': 1723, 'Лысьва': 1785, 'Кунгур': 1663, 'Соликамск': 1430, 'Березники': 1932, 'Полазна': 1623}
# 1623
# Изменённый словарь:  {'Пермь': 1723, 'Лысьва': 1785, 'Кунгур': 1663, 'Соликамск': 1430, 'Березники': 1932}
#
# Изначальное множество:  {1, 2.5, 'string'}
# Изменённое множество:  {1, 2.5, 'new_string', (3, 4, 5)}
