# Задача "Записать и запомнить"

info = [
    'Text for tell.',
    'Используйте кодировку utf-8.',
    'Because there are 2 languages!',
    'Спасибо!'
    ]


def custom_write(file_name, strings):

    pass



# Main

result = custom_write('test.txt', info)
for elem in result.items():
  print(elem)